In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from getpass import getpass

In [2]:
password = getpass()

········

In [3]:
# Create a Python connection with SQL database

connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
data = pd.read_sql_query('SELECT * FROM sakila.actor', engine)
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [5]:
# 1. How many distinct (different) actors' last names are there?

data1 = pd.read_sql_query('SELECT COUNT(DISTINCT(last_name)) FROM sakila.actor', engine)
data1.head()

   COUNT(DISTINCT(last_name))
0                         121

In [6]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

data2= pd.read_sql_query ("SELECT *, \
MONTHNAME(rental_date) AS month, DAYNAME(rental_date) AS weekday, \
CASE WHEN dayname(rental_date) IN ('Saturday', 'Sunday')THEN 'Weekend' ELSE 'Weekday'\
END AS day_type FROM rental" , engine)

data2.head(10)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,Tuesday,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,May,Tuesday,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,May,Tuesday,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,May,Tuesday,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,May,Tuesday,Weekday
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-15 21:30:53,May,Tuesday,Weekday
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2,2006-02-15 21:30:53,May,Tuesday,Weekday
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2,2006-02-15 21:30:53,May,Tuesday,Weekday
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1,2006-02-15 21:30:53,May,Wednesday,Weekday
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2,2006-02-15 21:30:53,May,Wednesday,Weekday

In [7]:
# 3. Get all films with ARMAGEDDON in the title.

data3= pd.read_sql_query("SELECT * FROM film WHERE title like '%%ARMAGEDDON%%'", engine)

data3.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [8]:
# 4. Get 10 the longest films.

data4= pd.read_sql_query('SELECT title,length FROM film ORDER BY length DESC LIMIT 10;', engine)

data4.head()

            title  length
0  DARN FORRESTER     185
1    POND SEATTLE     185
2   CHICAGO NORTH     185
3   MUSCLE BRIGHT     185
4    WORST BANGER     185

In [9]:
# 5. How many films include Behind the Scenes content?

data5= pd.read_sql_query("SELECT COUNT(special_features) as 'Behind_the_Scenes_content'\
FROM film \
WHERE special_features LIKE '%%Behind the Scenes%%'" , engine)

data5.head()

   Behind_the_Scenes_content
0                        538

In [10]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

result = engine.execute("SELECT rating, AVG(length)\
FROM sakila.film \
GROUP BY rating \
HAVING AVG(length) > 120")

rows = []
for row in result:
    rows.append(row)
    print(row)
    
data6= pd.DataFrame(rows)
data6.head()

('PG-13', Decimal('120.4439'))

  rating AVG(length)
0  PG-13    120.4439

In [11]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank.

data7= pd.read_sql_query("SELECT title, length, DENSE_RANK() OVER(ORDER BY length DESC) as 'Rank' \
FROM film \
WHERE length != 0 AND length IS NOT NULL", engine)

data7.head()

            title  length  Rank
0   CHICAGO NORTH     185     1
1  CONTROL ANTHEM     185     1
2  DARN FORRESTER     185     1
3     GANGS PRIDE     185     1
4       HOME PITY     185     1